IDEA StatiCa Open Model
CoordSystemByVector.VecX Property
Compatible with IDEA StatiCa Beta 21.0 - beta
 Axis X unit vector
 Namespace: IdeaRS.OpenModel.Geometry3D
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.0.1.1 (20.0.1.1)
Syntax
public Vector3D VecX { get; set; }
Public Property VecX As Vector3D
	Get
	Set
public:
property Vector3D^ VecX {
	Vector3D^ get ();
	void set (Vector3D^ value);
}
Property Value
Type: Vector3D
See Also
Reference
CoordSystemByVector Class
IdeaRS.OpenModel.Geometry3D Namespace